<a href="https://colab.research.google.com/github/rnignon/DAP/blob/main/project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [26]:
import matplotlib as mpl
import matplotlib.pyplot as plt
import seaborn as sns
import numpy as np
import pandas as pd

# Import as Dataframe
food = pd.read_csv('https://raw.githubusercontent.com/rnignon/DAP/main/naver_datalab_shoppingInsight_food.csv')
clothes = pd.read_csv('https://raw.githubusercontent.com/rnignon/DAP/main/naver_datalab_shoppingInsight_clothes.csv')
food

             날짜  식품
0    2020-01-01  49
1    2020-01-02  58
2    2020-01-03  53
3    2020-01-04  50
4    2020-01-05  56
..          ...  ..
362  2020-12-28  84
363  2020-12-29  77
364  2020-12-30  71
365  2020-12-31  56
366  2021-01-01  61

[367 rows x 2 columns]

In [27]:
clothes

             날짜  패션의류
0    2020-01-01  59.0
1    2020-01-02  58.0
2    2020-01-03  53.0
3    2020-01-04  59.0
4    2020-01-05  67.0
..          ...   ...
370         NaN   NaN
371         NaN   NaN
372         NaN   NaN
373         NaN   NaN
374         NaN   NaN

[375 rows x 2 columns]